#+TITLE: Setup Our Box
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+CREATOR: ii.coop
#+DATE: 21st of August, 2019
#+STARTUP: showeverything
#+PROPERTY: header-args:shell+ :dir "/ssh:root@147.75.69.215:/root"
#+PROPERTY: header-args:shell+ :dir (symbol-value 'org-file-dir)

[[/ssh:root@147.75.69.215:/]]
*** check for block devices
#+NAME: zpool setup
#+BEGIN_SRC shell
lsblk
#+END_SRC

#+RESULTS: zpool setup
#+begin_EXAMPLE
NAME    MAJ:MIN RM   SIZE RO TYPE MOUNTPOINT
sda       8:0    0 223.6G  0 disk 
├─sda1    8:1    0     2M  0 part 
├─sda2    8:2    0   1.9G  0 part [SWAP]
└─sda3    8:3    0 221.7G  0 part /
sdb       8:16   0 223.6G  0 disk 
nvme0n1 259:0    0   3.5T  0 disk 
#+end_EXAMPLE

*** zpool on nvme0n1
#+NAME: create zpool on nvme
#+BEGIN_SRC shell :prologue "(\n" :epilogue ") 2>&1\n:"
zpool create -m /zfs pool /dev/nvme0n1
#+END_SRC


#+NAME: inital state of the zpool
#+BEGIN_SRC shell
zpool list
#+END_SRC

#+RESULTS: inital state of the zpool
#+begin_EXAMPLE
NAME   SIZE  ALLOC   FREE  EXPANDSZ   FRAG    CAP  DEDUP  HEALTH  ALTROOT
pool  3.47T   120K  3.47T         -     0%     0%  1.00x  ONLINE  -
#+end_EXAMPLE

